In [434]:
import pandas as pd
import numpy as np

In [435]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

# 1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put inplace. Fill in these missing numbers and make the column an integer column(instead of a float column).

In [436]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [437]:
null_idx=np.where(df['FlightNumber'].isnull()==True)
#print(df)

df['FlightNumber']=df['FlightNumber'].fillna(method='ffill')
#print(df)

k=df['FlightNumber'].iloc[null_idx]
df['FlightNumber'].iloc[null_idx]=k+10

C:\Users\bodda\anaconda3\lib\site-packages\pandas\core\indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

In [438]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# 2. The From_To column would be better as two separate columns! Split eachstring on the underscore delimiter _ to give a new temporary DataFrame withthe correct values. Assign the correct column names to this temporaryDataFrame.

# 3. Notice how the capitalisation of the city names is all mixed up in thistemporary DataFrame. Standardise the strings so that only the first letter isuppercase (e.g. "londON" should become "London".)

# 4. Delete the From_To column from df and attach the temporary DataFramefrom the previous questions.

In [401]:
temp_df=df[['From_To']]
temp_df['city']=temp_df['From_To'].str.split('_')

C:\Users\bodda\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [402]:
for i in range(len(temp_df['city'])):
    temp_df['city'].iloc[i]=temp_df['city'].iloc[i][0].lower().capitalize()

C:\Users\bodda\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [403]:
temp_df['city']

0      London
1      Madrid
2      London
3    Budapest
4    Brussels
Name: city, dtype: object

In [404]:
temp_df.drop('From_To',axis=1,inplace=True)

C:\Users\bodda\anaconda3\lib\site-packages\pandas\core\frame.py:3997: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [405]:
df.drop('From_To',axis=1,inplace=True)

In [406]:
df=pd.concat([df,temp_df],axis=1)

In [407]:
df

   FlightNumber  RecentDelays              Airline      city
0       10045.0      [23, 47]               KLM(!)    London
1       10055.0            []    <Air France> (12)    Madrid
2       10065.0  [24, 43, 87]  (British Airways. )    London
3       10075.0          [13]       12. Air France  Budapest
4       10085.0      [67, 32]          "Swiss Air"  Brussels

# 5. In the RecentDelays column, the values have been entered into theDataFrame as a list. We would like each first value in its own column, eachsecond value in its own column, and so on. If there isn't an Nth value, the valueshould be NaN.Expand the Series of lists into a DataFrame named delays, rename the columnsdelay_1, delay_2, etc. and replace the unwanted RecentDelays column in df delays.

In [408]:
max(df['RecentDelays'].apply(len))

3

In [409]:
print(dict(df['RecentDelays']))

{0: [23, 47], 1: [], 2: [24, 43, 87], 3: [13], 4: [67, 32]}

In [426]:
delays={0:'delay_1',1:'delay_2',2:'delay_3'}
delay=pd.DataFrame(df['RecentDelays'].apply(pd.Series))

In [429]:
delay=delay.rename(delays,axis=1)

In [430]:
df.drop('RecentDelays',axis=1,inplace=True)

In [432]:
df=pd.concat([df,delay],axis=1)

In [433]:
df

   FlightNumber              Airline      city  delay_1  delay_2  delay_3
0       10045.0               KLM(!)    London     23.0     47.0      NaN
1       10055.0    <Air France> (12)    Madrid      NaN      NaN      NaN
2       10065.0  (British Airways. )    London     24.0     43.0     87.0
3       10075.0       12. Air France  Budapest     13.0      NaN      NaN
4       10085.0          "Swiss Air"  Brussels     67.0     32.0      NaN